app/controllers/locations_controller.rb

  def show
    @saved_location = SavedLocation.find_by(user_id: current_user.id, location_id: @location.id) if current_user
    @last_updated_user = User.find(@location.last_updated_user) if @location.last_updated_user
---
SELECT  "locations".* FROM "locations" WHERE "locations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    @location.update(location_params)
---
UPDATE "locations" SET "seats" = $1, "sockets" = $2, "updated_at" = $3 WHERE "locations"."id" = $4  [["seats", 0], ["sockets", 0], ["updated_at", 2017-02-13 04:49:26 UTC], ["id", 61]]

  def find_location
    @location = Location.find(params[:id])
---
SELECT  "locations".* FROM "locations" WHERE "locations"."id" = $1 LIMIT $2  [["id", 61], ["LIMIT", 1]]